Tekla Open API Reference for Tekla Structures 2025
GraphicPolyLine Constructor
 Create a black line with width 1 and solid line type.
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public GraphicPolyLine()
Public Sub New
See Also
Reference
GraphicPolyLine Class
GraphicPolyLine Overload
Tekla.Structures.Model.UI Namespace